-- Daily Check Point

출근 후


1. ssh 접속, api 연결 테스트
 --> 접속 성공 유무 작성
 --> 마지막 패스워드 변경일 작성
 
1. 배치 정상 수행 여부, 배치 수행 시간
 --> 쿼리로 작성하여 복붙 가능하게 할것.
 --> td_cmbatchjobresult

1. 데몬 프로세스 확인  


2. 배치 수행후 검증 오류 사항에 대하여 정리후 보고하기
--> 데이터 부재의 오류인지? 시스템 오류인지 확인
2. T-1 보고 결과 처리 오류 확인
 --> 업무 오류가 아닌 시스템 처리중 오류 사항 확인 

3. 사무소별 Daily 보고건수, I/F 적재건수 확인
 --> 쿼리로 작성하여 복붙 가능하게 할것.(전일 vs, 전주 vs, 전월)
 --> Src Table --> FxFwd 건수 


4. 오라클 백업 덤프 확인
 --> 65  to 179
 --> 179 to 179
 

 
5. 65번, 179번 디스크 사이즈 확인(Use% 80%이상이면 확인필요)
 --> df -h


 
6. Daily 메일 화면 내 오류 건수 확인/비교하기


trdm.swapdb_fwd_m_tr_info